---
kind: property
id: P:Autodesk.Revit.DB.MEPModel.ConnectorManager
source: html/ee6d27a2-5c57-8e13-f0c1-504028545220.htm
---
# Autodesk.Revit.DB.MEPModel.ConnectorManager Property

Retrieves the Connector Manager from this MEPModel.

## Syntax (C#)
```csharp
public ConnectorManager ConnectorManager { get; }
```